app/controllers/result_controller.rb

SELECT  "submissions".* FROM "submissions"  WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @submission = Submission.find(params[:id])