app/controllers/upload_controller.rb

INSERT INTO "submissions" ("created_at", "done", "email", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-31 04:37:48.736156"], ["done", "f"], ["email", "zh522@nyu.edu"], ["updated_at", "2014-07-31 04:37:48.736156"]]
---
  def handle_upload

    inputData = params[:inputData]

    inputFile = params[:inputFile]

    email = params[:email] || ''

    logger.debug "Input file is [#{'empty' if inputFile.nil?}].."

    email_msg = email.empty? ? '':'for ' + email

    if inputData
      submission = Submission.create(done: false, email: email)